<!-- add-pr-comment:github_plan -->

# staging/github Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # aws_iam_policy.dkim_audit will be created
  + resource "aws_iam_policy" "dkim_audit" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dkim-audit"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ses:List*",
                          + "ses:Get*",
                          + "ses:Describe*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }
  # aws_iam_role_policy_attachment.dkim_audit will be created
  + resource "aws_iam_role_policy_attachment" "dkim_audit" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dkim-audit"
    }
  # module.github_workflow_roles_dkim_audit.aws_iam_role.this["dkim-audit"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:cds-snc/notification-terraform:ref:refs/heads/dkim-audit"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::239043911459:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dkim-audit"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
      + inline_policy (known after apply)
    }
Plan: 3 to add, 0 to change, 0 to destroy.

# --- End of Plan 1 ---